{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source":
			{
				"Text": "# of Connections to Keep Free:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "BCA63D454C7C50A758875683B0E15059"
		},
		{
			"Source":
			{
				"Text": "(0 upgradeable)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "3CEFA89C415D47DF87C953A4F5A22837"
		},
		{
			"Source":
			{
				"Text": "+"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "BE9D645D4352A41A16C3D0A5F1F62C94"
		},
		{
			"Source":
			{
				"Text": "+"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "F8E467094A594E5C21A542B94D14B1E6"
		},
		{
			"Source":
			{
				"Text": "+"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "3739407645161CDED5901EACEAEE5915"
		},
		{
			"Source":
			{
				"Text": "0"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "72BCC75B46EB14C88FA0CB8AFFE0ACFA"
		},
		{
			"Source":
			{
				"Text": "Adjust Current Axis"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "0F38693943C29DCD75F8C1B27871C5B8"
		},
		{
			"Source":
			{
				"Text": "Adjust Recipe"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "FF3BF8944642F2DEE83E0685A53303EE"
		},
		{
			"Source":
			{
				"Text": "Adjust grid X-axis (forward/backward)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "15E8B3EA40E8AC8A1E8E818BA03670E5"
		},
		{
			"Source":
			{
				"Text": "Adjust grid Y-axis (left/right)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "311FCC0E4AB23FE12C19BA94A560D1FB"
		},
		{
			"Source":
			{
				"Text": "Adjust grid Z-axis (up/down)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "ADFEA69944158AB689D01EB52BA2A425"
		},
		{
			"Source":
			{
				"Text": "Adjust sideways offset for grid items"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "7945CB1F4E10CE8044DCBF8DC47322E1"
		},
		{
			"Source":
			{
				"Text": "Adjust spacing for currently selected axis"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "F10D935E43878D99436DE5979A4E7EFD"
		},
		{
			"Source":
			{
				"Text": "Adjust step height for layers"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "4878AB2843890693F30F2BBA496DCCE8"
		},
		{
			"Source":
			{
				"Text": "Always (0)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "DFC6C7C441EFDC29C8E28F8F68C31EC1"
		},
		{
			"Source":
			{
				"Text": "Anchor: Aim at a belt, pipe, or pole"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "7C1BBA564FF13BA590D8A89C48E3F2C8"
		},
		{
			"Source":
			{
				"Text": "Apply"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "B47F89084BCC9AA350A28FA221C23636"
		},
		{
			"Source":
			{
				"Text": "Apply"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "7437ABA34837D348E8DF65AD3084A209"
		},
		{
			"Source":
			{
				"Text": "Apply Immediately:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E17AB8624162E492F96BEEA15F396B38"
		},
		{
			"Source":
			{
				"Text": "Auto"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "29B5665E4347B8A528480EA82ED201BE"
		},
		{
			"Source":
			{
				"Text": "Auto (0)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "40EADFF242CC6D8E10A4EDB6D777D2BC"
		},
		{
			"Source":
			{
				"Text": "Auto (0)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "9852395F409F9C751F989FA1748BFA16"
		},
		{
			"Source":
			{
				"Text": "Auto (0)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A863449D4ED1EF98FD3531A57C03A83B"
		},
		{
			"Source":
			{
				"Text": "Auto 2D"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A9F4FD7C4ADCBE49DE0631A2046B8C32"
		},
		{
			"Source":
			{
				"Text": "Auto-Connect"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "B2E919BA4DFFD0537D0466A78067DA79"
		},
		{
			"Source":
			{
				"Text": "Auto-Connect"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "612CED6F4C85D3508F494B8544A0E178"
		},
		{
			"Source":
			{
				"Text": "Belt Auto-Connect:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "982A6A7845BDD236AE0D3D95B5081117"
		},
		{
			"Source":
			{
				"Text": "CANCEL"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "9423B8A2450BD3341A377D9BD4CCD62B"
		},
		{
			"Source":
			{
				"Text": "Cancel"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "5228C5F748363C93F80FCAAD3F9D0656"
		},
		{
			"Source":
			{
				"Text": "Cancel"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "1754F7834BF1389234CDF2A4813856D4"
		},
		{
			"Source":
			{
				"Text": "Capture:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "00C709B0454CE55D68FBC7B52A38DCC9"
		},
		{
			"Source":
			{
				"Text": "Classic (2)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "337DE321404C52EA519126A27AD16256"
		},
		{
			"Source":
			{
				"Text": "Clear"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "F9591CB1495ED57EB4D0F594527A7EC0"
		},
		{
			"Source":
			{
				"Text": "Close"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "80872D90422397A6EB8E4CA0469ECC2A"
		},
		{
			"Source":
			{
				"Text": "Close"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "CB15E1A74E71CFAEDB6CA3AA8994C227"
		},
		{
			"Source":
			{
				"Text": "Configure Smart! scaling, visualization, and HUD settings"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "98E28A8E4D25D9D8BCD4C08EC6A98DE6"
		},
		{
			"Source":
			{
				"Text": "Continue"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "BEFFBFCD44901FD1FD1921855BE72920"
		},
		{
			"Source":
			{
				"Text": "Core Smart! Foundations settings for HUD display and default scale values"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "FD8B2189447F09294CBA09A02293BB9C"
		},
		{
			"Source":
			{
				"Text": "Created:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "5E58E67641C680E01F9DF4816CE86AEC"
		},
		{
			"Source":
			{
				"Text": "Cross Splitters/Mergers"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "7A593AF64E9BB01288D106BC6229CBF9"
		},
		{
			"Source":
			{
				"Text": "Cross Storage Containers"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "5938A49142B563B4FB59E985E9AE1841"
		},
		{
			"Source":
			{
				"Text": "Cross Train Platforms"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "D042222F4CF5B96FB75D6AB15DFD0645"
		},
		{
			"Source":
			{
				"Text": "Curve"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "60DE1CEC4B85C0CC72203CBF61E7568D"
		},
		{
			"Source":
			{
				"Text": "Curve"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "2E5F43054D0239D4BAC0F4862CB459FB"
		},
		{
			"Source":
			{
				"Text": "Cycle Axis Mode"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "348DAE9A4D32A65A01DF6A8106D161BC"
		},
		{
			"Source":
			{
				"Text": "Cycle through X → Y → Z axes"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "9C14E6F8447F242BFBB485BD8E31A5F3"
		},
		{
			"Source":
			{
				"Text": "Dark (1)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "15B881014DC7C163FCB1419FB255A0EC"
		},
		{
			"Source":
			{
				"Text": "Decrease value for active feature (scaling, spacing, steps, or stagger)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "3BECA57E4ACCC555B29B23AC5605DDCD"
		},
		{
			"Source":
			{
				"Text": "Default"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "D16C08E24764156DC1CBDAB0287C8627"
		},
		{
			"Source":
			{
				"Text": "Default (0)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A6A1DA99437171CC3D6B8C9E2918CEE0"
		},
		{
			"Source":
			{
				"Text": "Delete"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "86485C3341F54E30A3912B828EBB43B9"
		},
		{
			"Source":
			{
				"Text": "Description:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "FE4E3B5449BAC236966D69844DCC835A"
		},
		{
			"Source":
			{
				"Text": "Detect Issues"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "9C1531E24044FDC579C089A23F379274"
		},
		{
			"Source":
			{
				"Text": "Direction:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "D767923D435A3AE2E45512B82680D5B7"
		},
		{
			"Source":
			{
				"Text": "Display directional arrows on holograms - This setting is reflected whenever you load into the game."
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "56A274114BA3A08EF8C23AB43C608625"
		},
		{
			"Source":
			{
				"Text": "Enabled:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "1967BC264E24C68A0D4003BC0415A74D"
		},
		{
			"Source":
			{
				"Text": "Entire Map"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "BE3FB1994C8451039886D1829DD59B06"
		},
		{
			"Source":
			{
				"Text": "Estimated Cost"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "74176A6A4B5B3CE8A9A4BA8F752D804C"
		},
		{
			"Source":
			{
				"Text": "Estimated Cost"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "173D524544632CCDED043A9E3F4F7CC3"
		},
		{
			"Source":
			{
				"Text": "Export to Clipboard"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "8D76C4194106F0990EE5B4965C252DEC"
		},
		{
			"Source":
			{
				"Text": "Factory Belt:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "6A814FF14A5D908592CB75B5F3C49515"
		},
		{
			"Source":
			{
				"Text": "Family Name Mk.1"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "BEFE3D9D4EA76F0E2C34198C02E30A1E"
		},
		{
			"Source":
			{
				"Text": "Flow Indicator:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "4EF2BE3248974565B7CB6CB071E5A0AC"
		},
		{
			"Source":
			{
				"Text": "Grid"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "D1E40EBC45CCE70BD7D4C79DA92073BF"
		},
		{
			"Source":
			{
				"Text": "Grid"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "6A0AF47F49481BD7EDFA268E87767546"
		},
		{
			"Source":
			{
				"Text": "Grid Axis:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E3241E41469BDEFAC0630BB5DDBF985F"
		},
		{
			"Source":
			{
				"Text": "Grid Total: 1 objects"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "7ECCEB924559BAD3A1844C80D4581EAE"
		},
		{
			"Source":
			{
				"Text": "Grid [X]:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "8D506F2B4C76A6B3C74053848808C4F6"
		},
		{
			"Source":
			{
				"Text": "Grid [Y]:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "666E77414BF1B031FDF02F98E2C8B73D"
		},
		{
			"Source":
			{
				"Text": "Grid [Z]:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "7C7628C444BA79A102B1B18187DC7F82"
		},
		{
			"Source":
			{
				"Text": "HUD Scale"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "9E038900477F0B65A5A64E91AB5C00F0"
		},
		{
			"Source":
			{
				"Text": "High Contrast (3)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "0B68620A45C29BCF2BD3D390E9C6440C"
		},
		{
			"Source":
			{
				"Text": "Hold to activate progressive layering (modifier key)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "93C024D64433A5447D2C0396B3C5CB33"
		},
		{
			"Source":
			{
				"Text": "Hold to activate rotation transform mode (modifier key)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "2B909A3E4443898FEB06568A0618C52A"
		},
		{
			"Source":
			{
				"Text": "Hold to activate sideways offset (modifier key)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E7D5F1A145882159A49EE89DEAA01EF5"
		},
		{
			"Source":
			{
				"Text": "Hold to activate spacing (modifier key)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "2878874049B6D5EE0A5D6D9B48259F72"
		},
		{
			"Source":
			{
				"Text": "Hold to scale X-axis. Combine with Y modifier to scale Z-axis."
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "9AE7D23346D4BB5B0192848D8291920C"
		},
		{
			"Source":
			{
				"Text": "Hold to scale Y-axis. Combine with X modifier to scale Z-axis."
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "FA69B4C54C1F9AC00819708F1BD00666"
		},
		{
			"Source":
			{
				"Text": "Horiz→Vert"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A70A70BC46CB9221B4A7618D9D344FCD"
		},
		{
			"Source":
			{
				"Text": "Import from Clipboard"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "5000E75B4C7ACE86D974D0A46033FFCF"
		},
		{
			"Source":
			{
				"Text": "Import from Last Extend"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "134562114F71695F8277DEA56F84981D"
		},
		{
			"Source":
			{
				"Text": "Increase value for active feature (scaling, spacing, steps, or stagger)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "1BCE444B43095B0D655193A1B416CBBD"
		},
		{
			"Source":
			{
				"Text": "Large Grid Warning"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "33C84A48437DD1E5D1CF0AAD223DC813"
		},
		{
			"Source":
			{
				"Text": "Main Tier:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "EDF5FE2A4FFD49C806FDF0818B4146B1"
		},
		{
			"Source":
			{
				"Text": "Manifold Lane Belt:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "5AEE36F145735AAE396E05B64D5085AA"
		},
		{
			"Source":
			{
				"Text": "Minimal (4)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A08F54F64F8642B9E7F8F1AA30D2B869"
		},
		{
			"Source":
			{
				"Text": "Mk1 (1)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "80ADD8BF4E442F2608D92FB8ECD49CC2"
		},
		{
			"Source":
			{
				"Text": "Mk1 (1)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "B67A2B1049D6C022FFE45AA3C7E91E0D"
		},
		{
			"Source":
			{
				"Text": "Mk2 (2)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "7A7B62144F20B0B73ABCD8B643EED6A1"
		},
		{
			"Source":
			{
				"Text": "Mk2 (2)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "6587C0CB460666BD6FC98BB018890DC5"
		},
		{
			"Source":
			{
				"Text": "Mk3 (3)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "438320444C8158C55C66F08F8D53EBD5"
		},
		{
			"Source":
			{
				"Text": "Mk4 (4)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "C0E174744867FC71F8E879B5AE7D69EE"
		},
		{
			"Source":
			{
				"Text": "Mk5 (5)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "C08F8647484002CCC38A78938534A251"
		},
		{
			"Source":
			{
				"Text": "Mk6 (6)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "31D1020F4EA86C6B0532A3916E9533CD"
		},
		{
			"Source":
			{
				"Text": "Monochrome (5)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "8E24BA32430E1A670137ABA048747BB8"
		},
		{
			"Source":
			{
				"Text": "Network"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "09B266E74168D79CC01A54B6220782CC"
		},
		{
			"Source":
			{
				"Text": "Never (2)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E9350DEF466B0A2E9F7FBDB9FA947A97"
		},
		{
			"Source":
			{
				"Text": "Noodle"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "928114D446D78C041AEF5D88157821E9"
		},
		{
			"Source":
			{
				"Text": "Not saved"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "CDF7639140F228F3095085B61DF1FC1A"
		},
		{
			"Source":
			{
				"Text": "Once (1)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A1723C3742687518D3D7FAB8769C4F43"
		},
		{
			"Source":
			{
				"Text": "Pipe Auto-Connect:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "CEE3C8C94913878EE42B35B7A1A60C45"
		},
		{
			"Source":
			{
				"Text": "Preset Name:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "835B4E7E4DCF1F9F16C24F9696BA3E8D"
		},
		{
			"Source":
			{
				"Text": "Presets >>"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A987CEA94C4EBF558C8157B00CAC336C"
		},
		{
			"Source":
			{
				"Text": "Press REFRESH to scan for upgradeable buildings. Press ESC or K to close."
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "66C35E014DB7009BE3B924A85F570FD7"
		},
		{
			"Source":
			{
				"Text": "Press to clear active recipe"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "790FF28E4D98D951C6AE27B8A147F50F"
		},
		{
			"Source":
			{
				"Text": "REFRESH"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "1CBF9AC24AB88ED704D8B89C23669BF7"
		},
		{
			"Source":
			{
				"Text": "Radius"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "1CBE81654BEC06C4EE4D2F9B77C6823C"
		},
		{
			"Source":
			{
				"Text": "Radius (m):"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "32F87FF84A2C859EEF06EDA73BD50D90"
		},
		{
			"Source":
			{
				"Text": "Ready"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "FD2BEAF2493FD288E0C03FB923FE3E94"
		},
		{
			"Source":
			{
				"Text": "Recipe"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "D41927F44896C5D9CF5915A3C26D6FCB"
		},
		{
			"Source":
			{
				"Text": "Recipe"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "474D445B4372B01758D4FCB5738904E3"
		},
		{
			"Source":
			{
				"Text": "Recipe Mode"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "310A5EFE4224B829F9BA469562A68951"
		},
		{
			"Source":
			{
				"Text": "Recipe Up/Down"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "F87C5DEE489864EDB5D02386C86E62CF"
		},
		{
			"Source":
			{
				"Text": "Repair All Issues"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "70622324402CD200612E9395164CE150"
		},
		{
			"Source":
			{
				"Text": "Repair result will appear here"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "C6DDD93A4DEF142BBA1E08BBE2381F1B"
		},
		{
			"Source":
			{
				"Text": "Reset"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "22E6825F472DF85F3EB3CB90A29FB6C1"
		},
		{
			"Source":
			{
				"Text": "Rotation"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "CF9FD17D416FD6EDEF05929AF3CC1202"
		},
		{
			"Source":
			{
				"Text": "Rotation"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "084B8B174368AF09A590B0BE112A0AE3"
		},
		{
			"Source":
			{
				"Text": "Rotation Mode"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E3CA9AD8424D9B1B3B996C97C1F70A61"
		},
		{
			"Source":
			{
				"Text": "Rotation [Z]:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "BDF47C914C7CA429FB3FB6AFB7933F36"
		},
		{
			"Source":
			{
				"Text": "Route mouse wheel input to the active Smart! feature (scaling, spacing, steps, or stagger)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "FA953BD649A5AEE3F69CB7AFE9E2A43A"
		},
		{
			"Source":
			{
				"Text": "Routing:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "B2CC5FE04DAE1DE572D7429026523EFD"
		},
		{
			"Source":
			{
				"Text": "Routing:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "84D9E2274CBB9448A3C97E8188ACFDAA"
		},
		{
			"Source":
			{
				"Text": "Run Detect to see results"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "96E044FE4DDABD241B0483A89D209A2C"
		},
		{
			"Source":
			{
				"Text": "SCAN NETWORK"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "827BDCB04E7D02296EA3E880D6C24DC3"
		},
		{
			"Source":
			{
				"Text": "Save Current"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "EA96D6484DFA8708F5C7AAB31B92AE93"
		},
		{
			"Source":
			{
				"Text": "Save New Preset"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "DD0B98B04A427071B009D7BAA464B531"
		},
		{
			"Source":
			{
				"Text": "Scale Forward/Back"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "7F2E5ED1421D2CB422D39B96E7FEFA25"
		},
		{
			"Source":
			{
				"Text": "Scale Left/Right"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A65B455D41D3967FE018129E6F8D99BC"
		},
		{
			"Source":
			{
				"Text": "Scale Up/Down"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "D62D58CF4AFE88D8DE519488D31F424F"
		},
		{
			"Source":
			{
				"Text": "Scale X Modifier"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "B433CC5C466EDDBF3105FA829F9B12D5"
		},
		{
			"Source":
			{
				"Text": "Scale Y Modifier"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "FECC44E2411C81715010F7B2FAD081E6"
		},
		{
			"Source":
			{
				"Text": "Scale of the HUD overlay (0.5 to 2.0)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "40982E73464C1D9E7F956C9F8A7B72D7"
		},
		{
			"Source":
			{
				"Text": "Scan"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "1322786544407AA4F8ED1B8190F76D9F"
		},
		{
			"Source":
			{
				"Text": "Scan network to see costs"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E66C9E5840CD757371D1B2A26B0937F7"
		},
		{
			"Source":
			{
				"Text": "Select Preset:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "910DF24B44D1104579DB5C9C5C74C215"
		},
		{
			"Source":
			{
				"Text": "Select items to see costs"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "9E972DC647E3D424CFE890B235FB1EE3"
		},
		{
			"Source":
			{
				"Text": "Share"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "6B9892D145A9E8A2054CEBAEF0A6B4E5"
		},
		{
			"Source":
			{
				"Text": "Show Direction Arrows (can be overridden)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "EA82618C44B70702397E7E97036E946B"
		},
		{
			"Source":
			{
				"Text": "Show/hide axis direction arrows"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "78E37EDB4BEB48A04A5139AC6A0C614D"
		},
		{
			"Source":
			{
				"Text": "Smart Restore"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "F506AD1F41CF8A81A27FC0A480EAE8B8"
		},
		{
			"Source":
			{
				"Text": "Smart! Configuration"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "7BAE3F3D4FEAEB14DC15CCBAC6FA6820"
		},
		{
			"Source":
			{
				"Text": "Smart! Foundations"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "97E5935349503B2191BFE4B385BC7AB3"
		},
		{
			"Source":
			{
				"Text": "Smart! Grid Scaling"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "51EB9D9A495D641249A89FA0BD6F76B3"
		},
		{
			"Source":
			{
				"Text": "Smart! Grid Scaling"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "331CFA504EADB43C56B9C1AF41012E2F"
		},
		{
			"Source":
			{
				"Text": "Smart! Grid Scaling"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "53A77D7341E0BB96E67D9287BEF26C24"
		},
		{
			"Source":
			{
				"Text": "Smart! Grid Scaling"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "62C6E10A41335FE94A371DB0EA31B799"
		},
		{
			"Source":
			{
				"Text": "Smart! Grid Scaling"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "B4E7FC1B4C29E5780A005DACF4F6605B"
		},
		{
			"Source":
			{
				"Text": "Smart! Grid Scaling"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "B8C9B67949C7644C3AE6519EBC26464D"
		},
		{
			"Source":
			{
				"Text": "Smart! Interface"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "F484CB0045E1F6610752E19D98C01DFE"
		},
		{
			"Source":
			{
				"Text": "Smart! Panel"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "466E938E4AA5B443D005619DEB8F0382"
		},
		{
			"Source":
			{
				"Text": "Smart! Recipe"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "86A78F2C47F34655E5C58484EC93E3AD"
		},
		{
			"Source":
			{
				"Text": "Smart! Recipe"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "1C0157F7400B84FCEA0CB0997F18ECFA"
		},
		{
			"Source":
			{
				"Text": "Smart! Rotation"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E522B9984A797E90FDF435B93981833C"
		},
		{
			"Source":
			{
				"Text": "Smart! Settings"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "9E3391284C17FB3E14B42C9F89042446"
		},
		{
			"Source":
			{
				"Text": "Smart! Spacing"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "1D5643D5431C6F63F8A943BCE13CBE7E"
		},
		{
			"Source":
			{
				"Text": "Smart! Spacing"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "246236E4495CCCF2A3E4FC85C85DA9AB"
		},
		{
			"Source":
			{
				"Text": "Smart! Spacing"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "12DA0489426F414A397D0589ED6C0745"
		},
		{
			"Source":
			{
				"Text": "Smart! Stagger"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "5162B61A422973421A9B5084A1B41030"
		},
		{
			"Source":
			{
				"Text": "Smart! Stagger"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "F5885ED64196DAF6BE5F878ED0AF0A29"
		},
		{
			"Source":
			{
				"Text": "Smart! Steps"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "63AABDCD482973D2CAFDF2932D97AE25"
		},
		{
			"Source":
			{
				"Text": "Smart! Steps"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "067E1A5040E18EA163524F8F205335A9"
		},
		{
			"Source":
			{
				"Text": "Smart! Upgrade Panel"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "8BB84C5240D8A57F87983A986C3DFB73"
		},
		{
			"Source":
			{
				"Text": "Spacing"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "0F271E57483F14E52826E7B80929D021"
		},
		{
			"Source":
			{
				"Text": "Spacing"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "04F9C34A452086EC92EFE99951F33CA3"
		},
		{
			"Source":
			{
				"Text": "Spacing Mode"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "9643BBEF4D4BFEB216B5CDB73AC1A4C8"
		},
		{
			"Source":
			{
				"Text": "Spacing [X]:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "8EFC95BC464E9CB593F20694FD0EBECF"
		},
		{
			"Source":
			{
				"Text": "Spacing [Y]:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "B10337FF407FCBDE7A5CFDB499DDA06E"
		},
		{
			"Source":
			{
				"Text": "Spacing [Z]:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "CD9D390548AF2EDB1BEEB3BF3F6DFC1A"
		},
		{
			"Source":
			{
				"Text": "Stagger"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "EC8782AA4259A49A95749593185BDDD4"
		},
		{
			"Source":
			{
				"Text": "Stagger"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E27D3D744732F544E37C8D8A42EE310D"
		},
		{
			"Source":
			{
				"Text": "Stagger Left/Right"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "6F0E40FD4B11CA1CEC6FC5B06EB0188C"
		},
		{
			"Source":
			{
				"Text": "Stagger Mode"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "AC9521FE4F1ABB4F0FDA12BE408820F6"
		},
		{
			"Source":
			{
				"Text": "Stagger [X]:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "2F4718E24977149EBF00A6A20612CE55"
		},
		{
			"Source":
			{
				"Text": "Stagger [Y]:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "EE73F81B420B282A3B6494A603B0D3C2"
		},
		{
			"Source":
			{
				"Text": "Stagger [ZX]:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A95D78134D39AC8E262B91A978BF10BE"
		},
		{
			"Source":
			{
				"Text": "Stagger [ZY]:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "1D588AB24EC519E9DFBD92B9399C1DF3"
		},
		{
			"Source":
			{
				"Text": "Steps"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E203222D46CBC39A1EF4688FE318BF2F"
		},
		{
			"Source":
			{
				"Text": "Steps"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "1DF084644913A60780296792F5B92BBF"
		},
		{
			"Source":
			{
				"Text": "Steps Mode"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A4625ACE4A31BA74C187C09C62723BE6"
		},
		{
			"Source":
			{
				"Text": "Steps Up/Down"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E148F27C4C01935B4E019BA49F4A0F55"
		},
		{
			"Source":
			{
				"Text": "Steps [X]:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "05CB8D764582E5B6A73943A48849CF91"
		},
		{
			"Source":
			{
				"Text": "Steps [Y]:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "3819B91A44F9FD3FB44B8696762C894E"
		},
		{
			"Source":
			{
				"Text": "Straight"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "8A7DD44D47B48C266B3B88AC01D1CEF3"
		},
		{
			"Source":
			{
				"Text": "Straight"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "0019837C427C49F6BA1DE5A2BAF52104"
		},
		{
			"Source":
			{
				"Text": "Target Tier:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "47FABC9743E900C118B8FCAF9C9076DE"
		},
		{
			"Source":
			{
				"Text": "Target Tier:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "C34C1A5F452AB8290A9A00BA9D73780D"
		},
		{
			"Source":
			{
				"Text": "These tools diagnose and repair conveyor chain corruption. Only use them if you are experiencing belt issues."
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "427A62BA4B691763413124A521EE7AA2"
		},
		{
			"Source":
			{
				"Text": "To Building:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "028EDCCB461000B904344599509A9EBC"
		},
		{
			"Source":
			{
				"Text": "Toggle Arrows"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "3326E4B341828CD7663F6285E104A803"
		},
		{
			"Source":
			{
				"Text": "Toggle Settings Form"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "3E62D33F4FA4C52320AB48BD9B6D8B1C"
		},
		{
			"Source":
			{
				"Text": "Toggle Smart Settings Form"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "D09E94C0499C4C4F3E606D9E2461B19A"
		},
		{
			"Source":
			{
				"Text": "Triage"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "D5988C104C18248A9BFD8485A40BE7BF"
		},
		{
			"Source":
			{
				"Text": "UPGRADE"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "0A60D4B54D01B286CA22F0A0967B6803"
		},
		{
			"Source":
			{
				"Text": "Update"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "3722F99840B64A5C83D834B045B172EE"
		},
		{
			"Source":
			{
				"Text": "Use Manifold Lane Belts:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "6B04A294497FDAED5E357AB4D546950A"
		},
		{
			"Source":
			{
				"Text": "Warning message here"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "BB16B38F4773E62C787CD8A7A950B2A0"
		},
		{
			"Source":
			{
				"Text": "X"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "1926932648C4B2B04FFA2DA78759EB8A"
		},
		{
			"Source":
			{
				"Text": "X (1)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "59B517F844E13DA8F3D539844F2C9378"
		},
		{
			"Source":
			{
				"Text": "X+Y (3)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "56027A5C460D5844EF237AB48DAA5A28"
		},
		{
			"Source":
			{
				"Text": "Y (2)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "444B8B2648F771FC835D1CABC302BA9E"
		},
		{
			"Source":
			{
				"Text": "m"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "163A9012423FDB16873994B1176FBA46"
		},
		{
			"Source":
			{
				"Text": "m"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "19FEA75E42F2EAEB5045A7A618AA3BC5"
		},
		{
			"Source":
			{
				"Text": "m"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "28D8DA55417456926DB8DD8DDC4E0B35"
		},
		{
			"Source":
			{
				"Text": "m"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "076C4CF14B7B5A752672109C803DB5CE"
		},
		{
			"Source":
			{
				"Text": "m"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "806E7DEE4D8AABCDA15FBBBC186BDE67"
		},
		{
			"Source":
			{
				"Text": "m"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "8EF12ABE4DDA79BF715BC9AEBA07DD52"
		},
		{
			"Source":
			{
				"Text": "m"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "9528DF244AFFBF43ACEFD9BB135A9496"
		},
		{
			"Source":
			{
				"Text": "m"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A8C1A78C4342647E16B71187E2A2AD25"
		},
		{
			"Source":
			{
				"Text": "m"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "CEA27E88405B94B46A0D5EB09367D566"
		},
		{
			"Source":
			{
				"Text": "°"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "23C90C2D418545EC4333738F056A5EE6"
		}
	],
	"Subnamespaces": [
		{
			"Namespace": "SmartFoundations",
			"Children": [
				{
					"Source":
					{
						"Text": " x "
					},
					"Translation":
					{
						"Text": " x "
					},
					"Key": "Upgrade_Separator"
				},
				{
					"Source":
					{
						"Text": "# of Connections to Keep Free:"
					},
					"Translation":
					{
						"Text": "保留连接数:"
					},
					"Key": "Config_PowerReserved"
				},
				{
					"Source":
					{
						"Text": "(No net cost)"
					},
					"Translation":
					{
						"Text": "（无净成本）"
					},
					"Key": "Upgrade_NoNetCost"
				},
				{
					"Source":
					{
						"Text": "({0} upgradeable)"
					},
					"Translation":
					{
						"Text": "（{0} 可升级）"
					},
					"Key": "Upgrade_UpgradeableCount"
				},
				{
					"Source":
					{
						"Text": "* Extreme grid - high risk of freeze/crash"
					},
					"Translation":
					{
						"Text": "* 超大网格 - 极高卡顿/崩溃风险"
					},
					"Key": "Panel_GridWarning_Danger"
				},
				{
					"Source":
					{
						"Text": "* Large grid"
					},
					"Translation":
					{
						"Text": "* 大型网格"
					},
					"Key": "Panel_GridWarning_Caution"
				},
				{
					"Source":
					{
						"Text": "* Very large grid - may cause temporary freeze"
					},
					"Translation":
					{
						"Text": "* 非常大的网格 - 可能导致暂时卡顿"
					},
					"Key": "Panel_GridWarning_Warning"
				},
				{
					"Source":
					{
						"Text": "*Auto-Connect Disabled (double-tap to re-enable)"
					},
					"Translation":
					{
						"Text": "*自动连接已禁用（双击重新启用）"
					},
					"Key": "HUD_AutoConnectDisabled"
				},
				{
					"Source":
					{
						"Text": "*Extend Active"
					},
					"Translation":
					{
						"Text": "*延伸激活"
					},
					"Key": "HUD_ExtendActive"
				},
				{
					"Source":
					{
						"Text": "*Extend Disabled"
					},
					"Translation":
					{
						"Text": "*延伸已禁用"
					},
					"Key": "HUD_ExtendDisabled"
				},
				{
					"Source":
					{
						"Text": "*Extend: {0}x{1}"
					},
					"Translation":
					{
						"Text": "*延伸: {0}x{1}"
					},
					"Key": "HUD_ExtendScaled"
				},
				{
					"Source":
					{
						"Text": "*Restore Active"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "HUD_RestoreActive"
				},
				{
					"Source":
					{
						"Text": "*Restore: {0}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "HUD_RestorePreset"
				},
				{
					"Source":
					{
						"Text": "*Smart Disabled (double-tap to re-enable)"
					},
					"Translation":
					{
						"Text": "*Smart已禁用（双击重新启用）"
					},
					"Key": "HUD_SmartDisabled"
				},
				{
					"Source":
					{
						"Text": "*Zoop Active - Scaling Disabled"
					},
					"Translation":
					{
						"Text": "*连续放置激活 — 缩放已禁用"
					},
					"Key": "HUD_ZoopActive"
				},
				{
					"Source":
					{
						"Text": "0=Auto, 1=Auto2D, 2=Straight, 3=Curve, 4=Noodle, 5=Horiz→Vert"
					},
					"Translation":
					{
						"Text": "0=Auto, 1=Auto2D, 2=Straight, 3=Curve, 4=Noodle, 5=Horiz→Vert"
					},
					"Key": "Config_PipeRoutingMode_TT"
				},
				{
					"Source":
					{
						"Text": "0=Default, 1=Curve, 2=Straight"
					},
					"Translation":
					{
						"Text": "0=Default, 1=Curve, 2=Straight"
					},
					"Key": "Config_BeltRoutingMode_TT"
				},
				{
					"Source":
					{
						"Text": "A preset named '{0}' already exists. Overwrite?"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_OverwriteMessage"
				},
				{
					"Source":
					{
						"Text": "Aim at a belt, pipe, or pole to scan its network"
					},
					"Translation":
					{
						"Text": "瞄准传送带、管道或电线杆以扫描其网络"
					},
					"Key": "Upgrade_TraversalHint"
				},
				{
					"Source":
					{
						"Text": "Aim at a belt, pipe, or power pole to scan its network"
					},
					"Translation":
					{
						"Text": "瞄准传送带、管道或电线杆以扫描其网络"
					},
					"Key": "Upgrade_AimAtTarget"
				},
				{
					"Source":
					{
						"Text": "Aim at a buildable and press Scan Network"
					},
					"Translation":
					{
						"Text": "瞄准可建造物并按扫描网络"
					},
					"Key": "Upgrade_AimAndScan"
				},
				{
					"Source":
					{
						"Text": "All clear — no chain issues found"
					},
					"Translation":
					{
						"Text": "全部正常 — 未发现链问题"
					},
					"Key": "Triage_AllClear"
				},
				{
					"Source":
					{
						"Text": "Anchor: {0} (Mk{1})"
					},
					"Translation":
					{
						"Text": "锚点: {0} (Mk{1})"
					},
					"Key": "Upgrade_Anchor"
				},
				{
					"Source":
					{
						"Text": "Apply"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Btn_ApplyPreset"
				},
				{
					"Source":
					{
						"Text": "Apply"
					},
					"Translation":
					{
						"Text": "应用"
					},
					"Key": "Panel_Btn_Apply"
				},
				{
					"Source":
					{
						"Text": "Apply Immediately"
					},
					"Translation":
					{
						"Text": "立即应用"
					},
					"Key": "Config_ApplyImmediate"
				},
				{
					"Source":
					{
						"Text": "Apply Immediately:"
					},
					"Translation":
					{
						"Text": "立即应用:"
					},
					"Key": "Panel_ApplyImmediately"
				},
				{
					"Source":
					{
						"Text": "Apply Smart Panel settings immediately without clicking Apply button"
					},
					"Translation":
					{
						"Text": "Apply Smart Panel settings immediately without clicking Apply button"
					},
					"Key": "Config_ApplyImmediate_TT"
				},
				{
					"Source":
					{
						"Text": "Arrow Axis Labels:"
					},
					"Translation":
					{
						"Text": "箭头轴标签:"
					},
					"Key": "Config_ArrowLabels"
				},
				{
					"Source":
					{
						"Text": "Arrow Orbit Animation:"
					},
					"Translation":
					{
						"Text": "箭头轨道动画:"
					},
					"Key": "Config_ArrowOrbit"
				},
				{
					"Source":
					{
						"Text": "Audit Complete: {0} upgradeable found across {1} structures."
					},
					"Translation":
					{
						"Text": "审计完成: 在 {1} 个结构中发现 {0} 个可升级项。"
					},
					"Key": "Upgrade_AuditComplete"
				},
				{
					"Source":
					{
						"Text": "Audit failed or was canceled."
					},
					"Translation":
					{
						"Text": "审计失败或已取消。"
					},
					"Key": "Upgrade_AuditFailed"
				},
				{
					"Source":
					{
						"Text": "Auditing world... {0}% ({1} scanned)"
					},
					"Translation":
					{
						"Text": "审计世界... {0}%（{1} 已扫描）"
					},
					"Key": "Upgrade_AuditProgress"
				},
				{
					"Source":
					{
						"Text": "Auto-Connect"
					},
					"Translation":
					{
						"Text": "自动连接"
					},
					"Key": "Panel_AutoConnectHeader"
				},
				{
					"Source":
					{
						"Text": "Auto-Connect"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_CaptureAutoConnect"
				},
				{
					"Source":
					{
						"Text": "Auto-Hold on Grid Change:"
					},
					"Translation":
					{
						"Text": "网格更改时自动锁定:"
					},
					"Key": "Config_AutoHold"
				},
				{
					"Source":
					{
						"Text": "Automatically chain distributors together using the Manifold Lane Belt tier"
					},
					"Translation":
					{
						"Text": "Automatically chain distributors together using the Manifold Lane Belt tier"
					},
					"Key": "Config_ManifoldLaneBelts_TT"
				},
				{
					"Source":
					{
						"Text": "Automatically lock hologram position after any grid modification (X/Y/Z > 1). Press Hold key to manually release. No world reload required."
					},
					"Translation":
					{
						"Text": "Automatically lock hologram position after any grid modification (X/Y/Z > 1). Press Hold key to manually release. No world reload required."
					},
					"Key": "Config_AutoHold_TT"
				},
				{
					"Source":
					{
						"Text": "Belt Auto-Connect:"
					},
					"Translation":
					{
						"Text": "传送带自动连接:"
					},
					"Key": "Panel_AC_BeltEnabled"
				},
				{
					"Source":
					{
						"Text": "Belt Auto-Connect:"
					},
					"Translation":
					{
						"Text": "传送带自动连接:"
					},
					"Key": "Config_AutoConnectEnabled"
				},
				{
					"Source":
					{
						"Text": "Belt Routing Mode:"
					},
					"Translation":
					{
						"Text": "传送带路由模式:"
					},
					"Key": "Config_BeltRoutingMode"
				},
				{
					"Source":
					{
						"Text": "Belt tier for distributor-to-building connections (0=Auto)"
					},
					"Translation":
					{
						"Text": "Belt tier for distributor-to-building connections (0=Auto)"
					},
					"Key": "Config_FactoryBelt_TT"
				},
				{
					"Source":
					{
						"Text": "Belt tier for distributor-to-distributor (manifold) connections (0=Auto)"
					},
					"Translation":
					{
						"Text": "Belt tier for distributor-to-distributor (manifold) connections (0=Auto)"
					},
					"Key": "Config_ManifoldLaneBelt_TT"
				},
				{
					"Source":
					{
						"Text": "Cancel"
					},
					"Translation":
					{
						"Text": "取消"
					},
					"Key": "Upgrade_Btn_Cancel"
				},
				{
					"Source":
					{
						"Text": "Cancel"
					},
					"Translation":
					{
						"Text": "取消"
					},
					"Key": "Panel_Btn_Cancel"
				},
				{
					"Source":
					{
						"Text": "Cannot find player location"
					},
					"Translation":
					{
						"Text": "无法找到玩家位置"
					},
					"Key": "Upgrade_NoPlayerLoc"
				},
				{
					"Source":
					{
						"Text": "Capture:"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_Capture"
				},
				{
					"Source":
					{
						"Text": "Chain repair complete"
					},
					"Translation":
					{
						"Text": "链修复完成"
					},
					"Key": "Triage_RepairComplete"
				},
				{
					"Source":
					{
						"Text": "Chain repair complete — save, reload, and run Detect again"
					},
					"Translation":
					{
						"Text": "链修复完成 — 请保存、重新加载并再次运行检测"
					},
					"Key": "Triage_RepairCompleteWithOrphans"
				},
				{
					"Source":
					{
						"Text": "Chain:"
					},
					"Translation":
					{
						"Text": "链式:"
					},
					"Key": "Panel_AC_Chain"
				},
				{
					"Source":
					{
						"Text": "Clear"
					},
					"Translation":
					{
						"Text": "清除"
					},
					"Key": "Panel_Btn_ClearRecipe"
				},
				{
					"Source":
					{
						"Text": "Click to select {0} for upgrade"
					},
					"Translation":
					{
						"Text": "点击选择 {0} 进行升级"
					},
					"Key": "Upgrade_ClickToSelect"
				},
				{
					"Source":
					{
						"Text": "Close"
					},
					"Translation":
					{
						"Text": "关闭"
					},
					"Key": "Upgrade_Btn_Close"
				},
				{
					"Source":
					{
						"Text": "Close"
					},
					"Translation":
					{
						"Text": "关闭"
					},
					"Key": "Panel_Btn_Close"
				},
				{
					"Source":
					{
						"Text": "Color theme for the Smart! HUD overlay (Default=FICSIT Orange, Dark=Muted grays, Classic=Green terminal, High Contrast=Bright white, Minimal=No border)"
					},
					"Translation":
					{
						"Text": "Color theme for the Smart! HUD overlay (Default=FICSIT Orange, Dark=Muted grays, Classic=Green terminal, High Contrast=Bright white, Minimal=No border)"
					},
					"Key": "Config_HUDTheme_TT"
				},
				{
					"Source":
					{
						"Text": "Connection Range:"
					},
					"Translation":
					{
						"Text": "连接范围:"
					},
					"Key": "Config_PowerRange"
				},
				{
					"Source":
					{
						"Text": "Continue"
					},
					"Translation":
					{
						"Text": "继续"
					},
					"Key": "Panel_Btn_Continue"
				},
				{
					"Source":
					{
						"Text": "Conveyor Belts"
					},
					"Translation":
					{
						"Text": "传送带"
					},
					"Key": "Family_Belt"
				},
				{
					"Source":
					{
						"Text": "Conveyor Lifts"
					},
					"Translation":
					{
						"Text": "垂直传送带"
					},
					"Key": "Family_Lift"
				},
				{
					"Source":
					{
						"Text": "Created:"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_CreatedAt"
				},
				{
					"Source":
					{
						"Text": "Cross Splitters/Mergers"
					},
					"Translation":
					{
						"Text": "穿越分离器/合并器"
					},
					"Key": "Upgrade_CrossSplitters"
				},
				{
					"Source":
					{
						"Text": "Cross Storage Containers"
					},
					"Translation":
					{
						"Text": "穿越存储容器"
					},
					"Key": "Upgrade_CrossStorage"
				},
				{
					"Source":
					{
						"Text": "Cross Train Platforms"
					},
					"Translation":
					{
						"Text": "穿越火车站台"
					},
					"Key": "Upgrade_CrossTrains"
				},
				{
					"Source":
					{
						"Text": "Cycle Mode"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Hint_CycleMode"
				},
				{
					"Source":
					{
						"Text": "Delete"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Btn_DeletePreset"
				},
				{
					"Source":
					{
						"Text": "Delete Preset"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_DeleteTitle"
				},
				{
					"Source":
					{
						"Text": "Delete preset '{0}'?"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_DeleteMessage"
				},
				{
					"Source":
					{
						"Text": "Description:"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_Description"
				},
				{
					"Source":
					{
						"Text": "Detect Issues"
					},
					"Translation":
					{
						"Text": "检测问题"
					},
					"Key": "Triage_Btn_Detect"
				},
				{
					"Source":
					{
						"Text": "Direction power poles connect to each other (Auto/X only/Y only/X+Y)"
					},
					"Translation":
					{
						"Text": "Direction power poles connect to each other (Auto/X only/Y only/X+Y)"
					},
					"Key": "Config_PowerGridAxis_TT"
				},
				{
					"Source":
					{
						"Text": "Direction:"
					},
					"Translation":
					{
						"Text": "方向:"
					},
					"Key": "Panel_AC_Direction"
				},
				{
					"Source":
					{
						"Text": "Display the Smart! HUD with scale counters"
					},
					"Translation":
					{
						"Text": "Display the Smart! HUD with scale counters"
					},
					"Key": "Config_ShowHUD_TT"
				},
				{
					"Source":
					{
						"Text": "Double Wall Outlet Mk.{0}"
					},
					"Translation":
					{
						"Text": "双面墙壁配电器 Mk.{0}"
					},
					"Key": "UpgradeRow_DoubleWallOutlet"
				},
				{
					"Source":
					{
						"Text": "EXTREME GRID WARNING!"
					},
					"Translation":
					{
						"Text": "极端网格警告！"
					},
					"Key": "Panel_Confirm_ExtremeTitle"
				},
				{
					"Source":
					{
						"Text": "Enable animated orbiting of directional arrows around the hologram. Disable for static arrows that still track player position."
					},
					"Translation":
					{
						"Text": "Enable animated orbiting of directional arrows around the hologram. Disable for static arrows that still track player position."
					},
					"Key": "Config_ArrowOrbit_TT"
				},
				{
					"Source":
					{
						"Text": "Enable automatic belt connections between distributors and buildings"
					},
					"Translation":
					{
						"Text": "Enable automatic belt connections between distributors and buildings"
					},
					"Key": "Config_AutoConnectEnabled_TT"
				},
				{
					"Source":
					{
						"Text": "Enable automatic belt connections between stackable conveyor poles"
					},
					"Translation":
					{
						"Text": "Enable automatic belt connections between stackable conveyor poles"
					},
					"Key": "Config_StackableBelt_TT"
				},
				{
					"Source":
					{
						"Text": "Enable automatic pipe connections between junctions and buildings"
					},
					"Translation":
					{
						"Text": "Enable automatic pipe connections between junctions and buildings"
					},
					"Key": "Config_PipeAutoConnect_TT"
				},
				{
					"Source":
					{
						"Text": "Enable automatic power connections between poles and buildings"
					},
					"Translation":
					{
						"Text": "Enable automatic power connections between poles and buildings"
					},
					"Key": "Config_PowerAutoConnect_TT"
				},
				{
					"Source":
					{
						"Text": "Enable the Extend feature (auto-clone manifolds when placing near existing buildings). Disable to prevent Extend from activating."
					},
					"Translation":
					{
						"Text": "Enable the Extend feature (auto-clone manifolds when placing near existing buildings). Disable to prevent Extend from activating."
					},
					"Key": "Config_ExtendEnabled_TT"
				},
				{
					"Source":
					{
						"Text": "Entire Map"
					},
					"Translation":
					{
						"Text": "整张地图"
					},
					"Key": "Upgrade_Btn_EntireMap"
				},
				{
					"Source":
					{
						"Text": "Error: Execution service not available"
					},
					"Translation":
					{
						"Text": "错误：执行服务不可用"
					},
					"Key": "Upgrade_ErrExecution"
				},
				{
					"Source":
					{
						"Text": "Error: No player controller"
					},
					"Translation":
					{
						"Text": "错误: 没有玩家控制器"
					},
					"Key": "Upgrade_ErrNoPlayer"
				},
				{
					"Source":
					{
						"Text": "Error: Subsystem not available"
					},
					"Translation":
					{
						"Text": "错误：子系统不可用"
					},
					"Key": "Upgrade_ErrSubsystem"
				},
				{
					"Source":
					{
						"Text": "Estimated Cost"
					},
					"Translation":
					{
						"Text": "预估成本"
					},
					"Key": "Upgrade_EstimatedCost"
				},
				{
					"Source":
					{
						"Text": "Export to Clipboard"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Btn_ExportPreset"
				},
				{
					"Source":
					{
						"Text": "Extend Enabled:"
					},
					"Translation":
					{
						"Text": "延伸启用:"
					},
					"Key": "Config_ExtendEnabled"
				},
				{
					"Source":
					{
						"Text": "Extend Power Poles:"
					},
					"Translation":
					{
						"Text": "延伸电线杆:"
					},
					"Key": "Config_ExtendPower"
				},
				{
					"Source":
					{
						"Text": "Factory Belt:"
					},
					"Translation":
					{
						"Text": "工厂传送带:"
					},
					"Key": "Config_FactoryBelt"
				},
				{
					"Source":
					{
						"Text": "Flow Indicator:"
					},
					"Translation":
					{
						"Text": "流向指示:"
					},
					"Key": "Panel_AC_FlowIndicator"
				},
				{
					"Source":
					{
						"Text": "Flow Indicator:"
					},
					"Translation":
					{
						"Text": "流量指示器:"
					},
					"Key": "Config_FlowIndicator"
				},
				{
					"Source":
					{
						"Text": "Found {0} items ({1} upgradeable)"
					},
					"Translation":
					{
						"Text": "找到 {0} 项（{1} 可升级）"
					},
					"Key": "Upgrade_FoundItems"
				},
				{
					"Source":
					{
						"Text": "Found {0} zombie chain(s), {1} split chain group(s), {2} chain=NONE belt(s), and {3} orphaned tick group(s) ({4} empty, {5} live belt/lift entries, {6} connected candidate group(s)).\nRepair will purge zombies, rebuild split chains, and re-register live conveyors from orphaned tick groups. After repair, save, reload, and run Detect again."
					},
					"Translation":
					{
						"Text": "发现 {0} 个僵尸链、{1} 个分裂链组、{2} 条 chain=NONE 传送带，以及 {3} 个孤立 tick 组（{4} 个为空，{5} 个活动传送带/升降机条目，{6} 个已连接候选组）。\\n修复将清除僵尸链、重建分裂链，并重新注册孤立 tick 组中的活动传送设备。修复后请保存、重新加载并再次运行检测。"
					},
					"Key": "Triage_IssuesFound"
				},
				{
					"Source":
					{
						"Text": "Grid"
					},
					"Translation":
					{
						"Text": "网格"
					},
					"Key": "Panel_Section_Grid"
				},
				{
					"Source":
					{
						"Text": "Grid"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_CaptureGrid"
				},
				{
					"Source":
					{
						"Text": "Grid Axis:"
					},
					"Translation":
					{
						"Text": "网格轴:"
					},
					"Key": "Panel_AC_GridAxis"
				},
				{
					"Source":
					{
						"Text": "Grid Axis:"
					},
					"Translation":
					{
						"Text": "网格轴:"
					},
					"Key": "Config_PowerGridAxis"
				},
				{
					"Source":
					{
						"Text": "Grid Total: {0} holograms"
					},
					"Translation":
					{
						"Text": "网格总计：{0} 个全息图"
					},
					"Key": "Panel_GridTotal"
				},
				{
					"Source":
					{
						"Text": "Grid [X]:"
					},
					"Translation":
					{
						"Text": "网格 [X]:"
					},
					"Key": "Panel_GridX"
				},
				{
					"Source":
					{
						"Text": "Grid [Y]:"
					},
					"Translation":
					{
						"Text": "网格 [Y]:"
					},
					"Key": "Panel_GridY"
				},
				{
					"Source":
					{
						"Text": "Grid [Z]:"
					},
					"Translation":
					{
						"Text": "网格 [Z]:"
					},
					"Key": "Panel_GridZ"
				},
				{
					"Source":
					{
						"Text": "Grid: 1x1x1"
					},
					"Translation":
					{
						"Text": "网格: 1x1x1"
					},
					"Key": "HUD_GridDefault"
				},
				{
					"Source":
					{
						"Text": "Grid: {0}x{1}x{2} ({3})"
					},
					"Translation":
					{
						"Text": "网格: {0}x{1}x{2} ({3})"
					},
					"Key": "HUD_Grid"
				},
				{
					"Source":
					{
						"Text": "HUD Position X"
					},
					"Translation":
					{
						"Text": "HUD位置 X"
					},
					"Key": "Config_HUDPosX"
				},
				{
					"Source":
					{
						"Text": "HUD Position Y"
					},
					"Translation":
					{
						"Text": "HUD位置 Y"
					},
					"Key": "Config_HUDPosY"
				},
				{
					"Source":
					{
						"Text": "HUD Theme:"
					},
					"Translation":
					{
						"Text": "HUD主题:"
					},
					"Key": "Config_HUDTheme"
				},
				{
					"Source":
					{
						"Text": "Horizontal position of HUD (0.0 = left, 1.0 = right). Default: 0.02"
					},
					"Translation":
					{
						"Text": "Horizontal position of HUD (0.0 = left, 1.0 = right). Default: 0.02"
					},
					"Key": "Config_HUDPosX_TT"
				},
				{
					"Source":
					{
						"Text": "Import from Clipboard"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Btn_ImportPreset"
				},
				{
					"Source":
					{
						"Text": "Import from Last Extend"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Btn_ImportFromExtend"
				},
				{
					"Source":
					{
						"Text": "Include power poles when using Extend to duplicate factory buildings"
					},
					"Translation":
					{
						"Text": "Include power poles when using Extend to duplicate factory buildings"
					},
					"Key": "Config_ExtendPower_TT"
				},
				{
					"Source":
					{
						"Text": "Invalid: {0}"
					},
					"Translation":
					{
						"Text": "无效: {0}"
					},
					"Key": "Upgrade_Invalid"
				},
				{
					"Source":
					{
						"Text": "Issues found - Repair handles zombies, splits, and orphaned tick groups"
					},
					"Translation":
					{
						"Text": "发现问题 - 修复会处理僵尸链、分裂链和孤立 tick 组"
					},
					"Key": "Triage_IssuesSummary"
				},
				{
					"Source":
					{
						"Text": "Large Grid Warning"
					},
					"Translation":
					{
						"Text": "大网格警告"
					},
					"Key": "Panel_Confirm_LargeTitle"
				},
				{
					"Source":
					{
						"Text": "Lift: ↕ {0}m  ⇓ {1}m"
					},
					"Translation":
					{
						"Text": "升降: ↕ {0}m  ⇓ {1}m"
					},
					"Key": "HUD_LiftHeight"
				},
				{
					"Source":
					{
						"Text": "Main Tier:"
					},
					"Translation":
					{
						"Text": "主等级:"
					},
					"Key": "Panel_AC_MainTier"
				},
				{
					"Source":
					{
						"Text": "Main Tier:"
					},
					"Translation":
					{
						"Text": "主等级:"
					},
					"Key": "Config_PipeMainTier"
				},
				{
					"Source":
					{
						"Text": "Manifold Lane Belt:"
					},
					"Translation":
					{
						"Text": "分配器传送带:"
					},
					"Key": "Config_ManifoldLaneBelt"
				},
				{
					"Source":
					{
						"Text": "Maximum distance to search for buildings to connect (in meters)"
					},
					"Translation":
					{
						"Text": "Maximum distance to search for buildings to connect (in meters)"
					},
					"Key": "Config_PowerRange_TT"
				},
				{
					"Source":
					{
						"Text": "Nearest {0}: {1}m {2}"
					},
					"Translation":
					{
						"Text": "最近的 {0}: {1}m {2}"
					},
					"Key": "Upgrade_Nearest"
				},
				{
					"Source":
					{
						"Text": "Network"
					},
					"Translation":
					{
						"Text": "网络"
					},
					"Key": "Upgrade_Tab_Network"
				},
				{
					"Source":
					{
						"Text": "New Preset Name:"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_PresetName"
				},
				{
					"Source":
					{
						"Text": "No audit snapshot. Press Scan to start."
					},
					"Translation":
					{
						"Text": "无审计数据。按扫描开始。"
					},
					"Key": "Upgrade_NoAudit"
				},
				{
					"Source":
					{
						"Text": "No compatible recipes"
					},
					"Translation":
					{
						"Text": "无兼容配方"
					},
					"Key": "Panel_Recipe_NoCompatible"
				},
				{
					"Source":
					{
						"Text": "No family selected - scan first"
					},
					"Translation":
					{
						"Text": "未选择类别 - 请先扫描"
					},
					"Key": "Upgrade_NoFamily"
				},
				{
					"Source":
					{
						"Text": "No instances found (entries not stored)"
					},
					"Translation":
					{
						"Text": "未找到实例（条目未存储）"
					},
					"Key": "Upgrade_NoInstances"
				},
				{
					"Source":
					{
						"Text": "No issues detected. Your conveyor chains are healthy."
					},
					"Translation":
					{
						"Text": "未检测到问题。你的传送带链状态正常。"
					},
					"Key": "Triage_NoIssues"
				},
				{
					"Source":
					{
						"Text": "No items to upgrade"
					},
					"Translation":
					{
						"Text": "没有可升级的项目"
					},
					"Key": "Upgrade_NoItems"
				},
				{
					"Source":
					{
						"Text": "No recipe selected ({0} available)"
					},
					"Translation":
					{
						"Text": "未选择配方（{0}个可用）"
					},
					"Key": "Panel_Recipe_NoneSelected_Count"
				},
				{
					"Source":
					{
						"Text": "No target - aim at a buildable"
					},
					"Translation":
					{
						"Text": "无目标 — 瞄准可建造物"
					},
					"Key": "Upgrade_NoTarget"
				},
				{
					"Source":
					{
						"Text": "None Selected"
					},
					"Translation":
					{
						"Text": "未选择"
					},
					"Key": "Panel_Recipe_NoneSelected"
				},
				{
					"Source":
					{
						"Text": "Not saved"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_NotSaved"
				},
				{
					"Source":
					{
						"Text": "Overwrite Preset"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_OverwriteTitle"
				},
				{
					"Source":
					{
						"Text": "Pipe Auto-Connect:"
					},
					"Translation":
					{
						"Text": "管道自动连接:"
					},
					"Key": "Config_PipeAutoConnect"
				},
				{
					"Source":
					{
						"Text": "Pipe Auto-Connect:"
					},
					"Translation":
					{
						"Text": "管道自动连接:"
					},
					"Key": "Panel_AC_PipeEnabled"
				},
				{
					"Source":
					{
						"Text": "Pipe Routing Mode:"
					},
					"Translation":
					{
						"Text": "管道路由模式:"
					},
					"Key": "Config_PipeRoutingMode"
				},
				{
					"Source":
					{
						"Text": "Pipe tier for junction-to-building connections (0=Auto)"
					},
					"Translation":
					{
						"Text": "Pipe tier for junction-to-building connections (0=Auto)"
					},
					"Key": "Config_PipeToBuilding_TT"
				},
				{
					"Source":
					{
						"Text": "Pipe tier for junction-to-junction (manifold) connections (0=Auto)"
					},
					"Translation":
					{
						"Text": "Pipe tier for junction-to-junction (manifold) connections (0=Auto)"
					},
					"Key": "Config_PipeMainTier_TT"
				},
				{
					"Source":
					{
						"Text": "Pipeline Pumps"
					},
					"Translation":
					{
						"Text": "管道泵"
					},
					"Key": "Family_Pump"
				},
				{
					"Source":
					{
						"Text": "Pipelines"
					},
					"Translation":
					{
						"Text": "管道"
					},
					"Key": "Family_Pipe"
				},
				{
					"Source":
					{
						"Text": "Power Auto-Connect:"
					},
					"Translation":
					{
						"Text": "电力自动连接:"
					},
					"Key": "Panel_AC_PowerEnabled"
				},
				{
					"Source":
					{
						"Text": "Power Auto-Connect:"
					},
					"Translation":
					{
						"Text": "电力自动连接:"
					},
					"Key": "Config_PowerAutoConnect"
				},
				{
					"Source":
					{
						"Text": "Power Poles"
					},
					"Translation":
					{
						"Text": "电线杆"
					},
					"Key": "Family_PowerPole"
				},
				{
					"Source":
					{
						"Text": "Power Towers"
					},
					"Translation":
					{
						"Text": "输电塔"
					},
					"Key": "Family_Tower"
				},
				{
					"Source":
					{
						"Text": "Press Scan to find upgradeable items"
					},
					"Translation":
					{
						"Text": "按扫描查找可升级的项目"
					},
					"Key": "Upgrade_PressScan"
				},
				{
					"Source":
					{
						"Text": "Radius"
					},
					"Translation":
					{
						"Text": "半径"
					},
					"Key": "Upgrade_Tab_Radius"
				},
				{
					"Source":
					{
						"Text": "Radius (m):"
					},
					"Translation":
					{
						"Text": "半径 (m):"
					},
					"Key": "Upgrade_RadiusLabel"
				},
				{
					"Source":
					{
						"Text": "Ready"
					},
					"Translation":
					{
						"Text": "就绪"
					},
					"Key": "Upgrade_Ready"
				},
				{
					"Source":
					{
						"Text": "Recipe"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_CaptureRecipe"
				},
				{
					"Source":
					{
						"Text": "Recipe"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Hint_Recipe"
				},
				{
					"Source":
					{
						"Text": "Recipe {0}/{1}: {2}"
					},
					"Translation":
					{
						"Text": "配方 {0}/{1}: {2}"
					},
					"Key": "HUD_Recipe"
				},
				{
					"Source":
					{
						"Text": "Recipe {0}/{1}: {2}"
					},
					"Translation":
					{
						"Text": "配方 {0}/{1}: {2}"
					},
					"Key": "Panel_Recipe"
				},
				{
					"Source":
					{
						"Text": "Recipe* {0}/{1}: {2}"
					},
					"Translation":
					{
						"Text": "配方* {0}/{1}: {2}"
					},
					"Key": "Panel_Recipe_Active"
				},
				{
					"Source":
					{
						"Text": "Recipe* {0}/{1}: {2}"
					},
					"Translation":
					{
						"Text": "配方* {0}/{1}: {2}"
					},
					"Key": "HUD_RecipeActive"
				},
				{
					"Source":
					{
						"Text": "Recipes"
					},
					"Translation":
					{
						"Text": "配方"
					},
					"Key": "Panel_RecipeHeader"
				},
				{
					"Source":
					{
						"Text": "Repair All Issues"
					},
					"Translation":
					{
						"Text": "修复所有问题"
					},
					"Key": "Triage_Btn_Repair"
				},
				{
					"Source":
					{
						"Text": "Repair complete. Nothing needed fixing."
					},
					"Translation":
					{
						"Text": "修复完成。没有需要修复的内容。"
					},
					"Key": "Triage_RepairNone"
				},
				{
					"Source":
					{
						"Text": "Repair complete. Removed {0} zombie chain(s), rebuilt {1} split group(s), and re-registered {6} live conveyor(s) from {3} orphaned tick group(s), including {4} empty group(s) and {5} live belt(s). Save, reload, and run Detect again."
					},
					"Translation":
					{
						"Text": "修复完成。已移除 {0} 个僵尸链，重建 {1} 个分裂组，并从 {3} 个孤立 tick 组中重新注册 {6} 个活动传送设备，其中包括 {4} 个空组和 {5} 条活动传送带。请保存、重新加载并再次运行检测。"
					},
					"Key": "Triage_RepairDone"
				},
				{
					"Source":
					{
						"Text": "Repair complete. Removed {0} zombie chain(s), rebuilt {1} split group(s), and re-registered {7} live conveyor(s) from {3} orphaned tick group(s), including {4} empty group(s) and {5} live belt(s). A diagnostic report was written to: {6}"
					},
					"Translation":
					{
						"Text": "修复完成。已移除 {0} 个僵尸链，重建 {1} 个分裂组，并从 {3} 个孤立 tick 组中重新注册 {7} 个活动传送设备，其中包括 {4} 个空组和 {5} 条活动传送带。诊断报告已写入：{6}"
					},
					"Key": "Triage_RepairDoneWithReport"
				},
				{
					"Source":
					{
						"Text": "Repairing chain issues..."
					},
					"Translation":
					{
						"Text": "正在修复链问题..."
					},
					"Key": "Triage_Repairing"
				},
				{
					"Source":
					{
						"Text": "Reserve this many connections on each power pole for manual wiring"
					},
					"Translation":
					{
						"Text": "Reserve this many connections on each power pole for manual wiring"
					},
					"Key": "Config_PowerReserved_TT"
				},
				{
					"Source":
					{
						"Text": "Reserved:"
					},
					"Translation":
					{
						"Text": "保留:"
					},
					"Key": "Panel_AC_Reserved"
				},
				{
					"Source":
					{
						"Text": "Reset"
					},
					"Translation":
					{
						"Text": "重置"
					},
					"Key": "Panel_Btn_Reset"
				},
				{
					"Source":
					{
						"Text": "Rotation"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_CaptureRotation"
				},
				{
					"Source":
					{
						"Text": "Rotation"
					},
					"Translation":
					{
						"Text": "旋转"
					},
					"Key": "Panel_Section_Rotation"
				},
				{
					"Source":
					{
						"Text": "Rotation"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Hint_Rotation"
				},
				{
					"Source":
					{
						"Text": "Rotation [Z]:"
					},
					"Translation":
					{
						"Text": "旋转 [Z]:"
					},
					"Key": "Panel_RotationZ"
				},
				{
					"Source":
					{
						"Text": "Rotation [Z]{0}: {1}°"
					},
					"Translation":
					{
						"Text": "旋转 [Z]{0}: {1}°"
					},
					"Key": "HUD_RotationZ"
				},
				{
					"Source":
					{
						"Text": "Rotation [Z]{0}: {1}° (R={2}m, {3}/circle)"
					},
					"Translation":
					{
						"Text": "旋转 [Z]{0}: {1}° (R={2}m, {3}/圈)"
					},
					"Key": "HUD_RotationZFull"
				},
				{
					"Source":
					{
						"Text": "Rotation*: 0.0°"
					},
					"Translation":
					{
						"Text": "旋转*: 0.0°"
					},
					"Key": "HUD_RotationDefault"
				},
				{
					"Source":
					{
						"Text": "Routing:"
					},
					"Translation":
					{
						"Text": "路由:"
					},
					"Key": "Panel_AC_Routing"
				},
				{
					"Source":
					{
						"Text": "SMART!"
					},
					"Translation":
					{
						"Text": "SMART!"
					},
					"Key": "HUD_Header"
				},
				{
					"Source":
					{
						"Text": "Save Current"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Btn_SavePreset"
				},
				{
					"Source":
					{
						"Text": "Scale X"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Hint_ScaleX"
				},
				{
					"Source":
					{
						"Text": "Scale Y"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Hint_ScaleY"
				},
				{
					"Source":
					{
						"Text": "Scale Z"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Hint_ScaleZ"
				},
				{
					"Source":
					{
						"Text": "Scan"
					},
					"Translation":
					{
						"Text": "扫描"
					},
					"Key": "Upgrade_Btn_Scan"
				},
				{
					"Source":
					{
						"Text": "Scan Network"
					},
					"Translation":
					{
						"Text": "扫描网络"
					},
					"Key": "Upgrade_Btn_ScanNetwork"
				},
				{
					"Source":
					{
						"Text": "Scan failed: {0}"
					},
					"Translation":
					{
						"Text": "扫描失败: {0}"
					},
					"Key": "Upgrade_ScanFailed"
				},
				{
					"Source":
					{
						"Text": "Scan network to see costs"
					},
					"Translation":
					{
						"Text": "扫描网络以查看费用"
					},
					"Key": "Upgrade_ScanCosts"
				},
				{
					"Source":
					{
						"Text": "Scanning map for chain issues..."
					},
					"Translation":
					{
						"Text": "正在扫描地图中的链问题..."
					},
					"Key": "Triage_Detecting"
				},
				{
					"Source":
					{
						"Text": "Scanning network..."
					},
					"Translation":
					{
						"Text": "正在扫描网络..."
					},
					"Key": "Upgrade_Scanning"
				},
				{
					"Source":
					{
						"Text": "Select a family to see costs"
					},
					"Translation":
					{
						"Text": "选择一个类别以查看费用"
					},
					"Key": "Upgrade_SelectFamily"
				},
				{
					"Source":
					{
						"Text": "Select a row first to upgrade"
					},
					"Translation":
					{
						"Text": "请先选择一行进行升级"
					},
					"Key": "Upgrade_SelectRow"
				},
				{
					"Source":
					{
						"Text": "Select a target tier from the dropdown"
					},
					"Translation":
					{
						"Text": "从下拉菜单中选择目标等级"
					},
					"Key": "Upgrade_SelectTier"
				},
				{
					"Source":
					{
						"Text": "Select target tier"
					},
					"Translation":
					{
						"Text": "选择目标等级"
					},
					"Key": "Upgrade_SelectTargetTier"
				},
				{
					"Source":
					{
						"Text": "Selected Preset:"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_SelectPreset"
				},
				{
					"Source":
					{
						"Text": "Set radius and press Scan to find items"
					},
					"Translation":
					{
						"Text": "设置半径并按扫描查找项目"
					},
					"Key": "Upgrade_SetRadiusScan"
				},
				{
					"Source":
					{
						"Text": "Settings: {0}"
					},
					"Translation":
					{
						"Text": "设置: {0}"
					},
					"Key": "HUD_Settings"
				},
				{
					"Source":
					{
						"Text": "Settings: {0}*"
					},
					"Translation":
					{
						"Text": "设置: {0}*"
					},
					"Key": "HUD_SettingsCurrent"
				},
				{
					"Source":
					{
						"Text": "Settings: {0}{1}"
					},
					"Translation":
					{
						"Text": "设置: {0}{1}"
					},
					"Key": "HUD_SettingsActive"
				},
				{
					"Source":
					{
						"Text": "Show HUD Overlay"
					},
					"Translation":
					{
						"Text": "显示HUD"
					},
					"Key": "Config_ShowHUD"
				},
				{
					"Source":
					{
						"Text": "Show X/Y/Z text labels on directional arrows. Disable for cleaner arrow visuals without text."
					},
					"Translation":
					{
						"Text": "Show X/Y/Z text labels on directional arrows. Disable for cleaner arrow visuals without text."
					},
					"Key": "Config_ArrowLabels_TT"
				},
				{
					"Source":
					{
						"Text": "Show flow direction indicator on pipes (off = \"Clean\" style)"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Config_FlowIndicator_TT"
				},
				{
					"Source":
					{
						"Text": "Smart Panel"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Hint_SmartPanel"
				},
				{
					"Source":
					{
						"Text": "Smart Restore"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Section_Presets"
				},
				{
					"Source":
					{
						"Text": "Smart! Extend"
					},
					"Translation":
					{
						"Text": "Smart! 延伸"
					},
					"Key": "Panel_Title_Extend"
				},
				{
					"Source":
					{
						"Text": "Smart! Panel"
					},
					"Translation":
					{
						"Text": "Smart! 面板"
					},
					"Key": "Panel_Title"
				},
				{
					"Source":
					{
						"Text": "Smart! Upgrade Panel"
					},
					"Translation":
					{
						"Text": "Smart! 升级面板"
					},
					"Key": "Upgrade_Title"
				},
				{
					"Source":
					{
						"Text": "Spacing"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_CaptureSpacing"
				},
				{
					"Source":
					{
						"Text": "Spacing"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Hint_Spacing"
				},
				{
					"Source":
					{
						"Text": "Spacing"
					},
					"Translation":
					{
						"Text": "间距"
					},
					"Key": "Panel_Section_Spacing"
				},
				{
					"Source":
					{
						"Text": "Spacing [X]:"
					},
					"Translation":
					{
						"Text": "间距 [X]:"
					},
					"Key": "Panel_SpacingX"
				},
				{
					"Source":
					{
						"Text": "Spacing [X]{0}: {1}m"
					},
					"Translation":
					{
						"Text": "间距 [X]{0}: {1}m"
					},
					"Key": "HUD_SpacingX"
				},
				{
					"Source":
					{
						"Text": "Spacing [Y]:"
					},
					"Translation":
					{
						"Text": "间距 [Y]:"
					},
					"Key": "Panel_SpacingY"
				},
				{
					"Source":
					{
						"Text": "Spacing [Y]{0}: {1}m"
					},
					"Translation":
					{
						"Text": "间距 [Y]{0}: {1}m"
					},
					"Key": "HUD_SpacingY"
				},
				{
					"Source":
					{
						"Text": "Spacing [Z]:"
					},
					"Translation":
					{
						"Text": "间距 [Z]:"
					},
					"Key": "Panel_SpacingZ"
				},
				{
					"Source":
					{
						"Text": "Spacing [Z]{0}: {1}m"
					},
					"Translation":
					{
						"Text": "间距 [Z]{0}: {1}m"
					},
					"Key": "HUD_SpacingZ"
				},
				{
					"Source":
					{
						"Text": "Spacing*: 0.0m"
					},
					"Translation":
					{
						"Text": "间距*: 0.0m"
					},
					"Key": "HUD_SpacingDefault"
				},
				{
					"Source":
					{
						"Text": "Stackable Belt Auto-Connect"
					},
					"Translation":
					{
						"Text": "可堆叠传送带自动连接"
					},
					"Key": "Config_StackableBelt"
				},
				{
					"Source":
					{
						"Text": "Stagger"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Hint_Stagger"
				},
				{
					"Source":
					{
						"Text": "Stagger"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_CaptureStagger"
				},
				{
					"Source":
					{
						"Text": "Stagger"
					},
					"Translation":
					{
						"Text": "交错"
					},
					"Key": "Panel_Section_Stagger"
				},
				{
					"Source":
					{
						"Text": "Stagger [X]:"
					},
					"Translation":
					{
						"Text": "交错 [X]:"
					},
					"Key": "Panel_StaggerX"
				},
				{
					"Source":
					{
						"Text": "Stagger [X]{0}: {1}m sideways"
					},
					"Translation":
					{
						"Text": "交错 [X]{0}: {1}m 横向"
					},
					"Key": "HUD_StaggerX"
				},
				{
					"Source":
					{
						"Text": "Stagger [Y]:"
					},
					"Translation":
					{
						"Text": "交错 [Y]:"
					},
					"Key": "Panel_StaggerY"
				},
				{
					"Source":
					{
						"Text": "Stagger [Y]{0}: {1}m forward"
					},
					"Translation":
					{
						"Text": "交错 [Y]{0}: {1}m 前方"
					},
					"Key": "HUD_StaggerY"
				},
				{
					"Source":
					{
						"Text": "Stagger [ZX]:"
					},
					"Translation":
					{
						"Text": "交错 [ZX]:"
					},
					"Key": "Panel_StaggerZX"
				},
				{
					"Source":
					{
						"Text": "Stagger [ZX]{0}: {1}m lean forward"
					},
					"Translation":
					{
						"Text": "交错 [ZX]{0}: {1}m 前移"
					},
					"Key": "HUD_StaggerZX"
				},
				{
					"Source":
					{
						"Text": "Stagger [ZY]:"
					},
					"Translation":
					{
						"Text": "交错 [ZY]:"
					},
					"Key": "Panel_StaggerZY"
				},
				{
					"Source":
					{
						"Text": "Stagger [ZY]{0}: {1}m lean sideways"
					},
					"Translation":
					{
						"Text": "交错 [ZY]{0}: {1}m 侧移"
					},
					"Key": "HUD_StaggerZY"
				},
				{
					"Source":
					{
						"Text": "Stagger*: 0.0m"
					},
					"Translation":
					{
						"Text": "交错*: 0.0m"
					},
					"Key": "HUD_StaggerDefault"
				},
				{
					"Source":
					{
						"Text": "Steps"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Restore_CaptureSteps"
				},
				{
					"Source":
					{
						"Text": "Steps"
					},
					"Translation":
					{
						"Text": "台阶"
					},
					"Key": "Panel_Section_Steps"
				},
				{
					"Source":
					{
						"Text": "Steps"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Hint_Steps"
				},
				{
					"Source":
					{
						"Text": "Steps [X]:"
					},
					"Translation":
					{
						"Text": "台阶 [X]:"
					},
					"Key": "Panel_StepsX"
				},
				{
					"Source":
					{
						"Text": "Steps [X]{0}: {1}m columns"
					},
					"Translation":
					{
						"Text": "台阶 [X]{0}: {1}m 列"
					},
					"Key": "HUD_StepsX"
				},
				{
					"Source":
					{
						"Text": "Steps [Y]:"
					},
					"Translation":
					{
						"Text": "台阶 [Y]:"
					},
					"Key": "Panel_StepsY"
				},
				{
					"Source":
					{
						"Text": "Steps [Y]{0}: {1}m rows"
					},
					"Translation":
					{
						"Text": "台阶 [Y]{0}: {1}m 行"
					},
					"Key": "HUD_StepsY"
				},
				{
					"Source":
					{
						"Text": "Steps*: 0.0m"
					},
					"Translation":
					{
						"Text": "台阶*: 0.0m"
					},
					"Key": "HUD_StepsDefault"
				},
				{
					"Source":
					{
						"Text": "Target Tier:"
					},
					"Translation":
					{
						"Text": "目标等级:"
					},
					"Key": "Upgrade_TargetTier"
				},
				{
					"Source":
					{
						"Text": "Target is not upgradeable - aim at a belt, pipe, or power pole"
					},
					"Translation":
					{
						"Text": "目标不可升级 — 瞄准传送带、管道或电线杆"
					},
					"Key": "Upgrade_NotUpgradeable"
				},
				{
					"Source":
					{
						"Text": "These tools diagnose conveyor chain issues after mass upgrades or save/load. Repair purges zombie chains, rebuilds split chains, and re-registers orphaned conveyor tick groups after load. Save before repair; after repair, save, reload, and run Detect again."
					},
					"Translation":
					{
						"Text": "这些工具用于诊断批量升级或保存/加载后的传送带链问题。修复会清除僵尸链、重建分裂链，并在加载后重新注册孤立的传送带 tick 组。修复前请保存；修复后请保存、重新加载并再次运行检测。"
					},
					"Key": "Triage_Warning"
				},
				{
					"Source":
					{
						"Text": "To Building:"
					},
					"Translation":
					{
						"Text": "到建筑:"
					},
					"Key": "Config_PipeToBuilding"
				},
				{
					"Source":
					{
						"Text": "To Building:"
					},
					"Translation":
					{
						"Text": "到建筑:"
					},
					"Key": "Panel_AC_ToBuilding"
				},
				{
					"Source":
					{
						"Text": "Triage"
					},
					"Translation":
					{
						"Text": "诊断"
					},
					"Key": "Upgrade_Tab_Triage"
				},
				{
					"Source":
					{
						"Text": "UPGRADE"
					},
					"Translation":
					{
						"Text": "升级"
					},
					"Key": "Upgrade_Btn_Upgrade"
				},
				{
					"Source":
					{
						"Text": "Unknown"
					},
					"Translation":
					{
						"Text": "未知"
					},
					"Key": "Family_Unknown"
				},
				{
					"Source":
					{
						"Text": "Update"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Panel_Btn_UpdatePreset"
				},
				{
					"Source":
					{
						"Text": "Upgrade cancelled: {0}/{1} completed"
					},
					"Translation":
					{
						"Text": "升级已取消: {0}/{1} 已完成"
					},
					"Key": "Upgrade_Cancelled"
				},
				{
					"Source":
					{
						"Text": "Upgrade complete: {0} success, {1} failed, {2} skipped"
					},
					"Translation":
					{
						"Text": "升级完成: {0} 成功, {1} 失败, {2} 跳过"
					},
					"Key": "Upgrade_Complete"
				},
				{
					"Source":
					{
						"Text": "Upgrading {0} Mk.{1} → Mk.{2}..."
					},
					"Translation":
					{
						"Text": "升级 {0} Mk.{1} → Mk.{2}..."
					},
					"Key": "Upgrade_Upgrading"
				},
				{
					"Source":
					{
						"Text": "Upgrading... {0}/{1} ({2}%)"
					},
					"Translation":
					{
						"Text": "升级中... {0}/{1} ({2}%)"
					},
					"Key": "Upgrade_ProgressCount"
				},
				{
					"Source":
					{
						"Text": "Use Detect to scan for chain issues"
					},
					"Translation":
					{
						"Text": "使用“检测”扫描链问题"
					},
					"Key": "Triage_Ready"
				},
				{
					"Source":
					{
						"Text": "Use Manifold Lane Belts:"
					},
					"Translation":
					{
						"Text": "使用分配器传送带:"
					},
					"Key": "Config_ManifoldLaneBelts"
				},
				{
					"Source":
					{
						"Text": "Vertical position of HUD (0.0 = top, 1.0 = bottom). Default: 0.25"
					},
					"Translation":
					{
						"Text": "Vertical position of HUD (0.0 = top, 1.0 = bottom). Default: 0.25"
					},
					"Key": "Config_HUDPosY_TT"
				},
				{
					"Source":
					{
						"Text": "Wall Outlet Mk.{0}"
					},
					"Translation":
					{
						"Text": "墙壁配电器 Mk.{0}"
					},
					"Key": "UpgradeRow_WallOutlet"
				},
				{
					"Source":
					{
						"Text": "Wall Outlets (Double)"
					},
					"Translation":
					{
						"Text": "墙壁接电桩（双面）"
					},
					"Key": "Family_WallOutletDouble"
				},
				{
					"Source":
					{
						"Text": "Wall Outlets (Single)"
					},
					"Translation":
					{
						"Text": "墙壁接电桩（单面）"
					},
					"Key": "Family_WallOutletSingle"
				},
				{
					"Source":
					{
						"Text": "X"
					},
					"Translation":
					{
						"Text": "X"
					},
					"Key": "Upgrade_Btn_X"
				},
				{
					"Source":
					{
						"Text": "X"
					},
					"Translation":
					{
						"Text": "X"
					},
					"Key": "ArrowLabel_X"
				},
				{
					"Source":
					{
						"Text": "Y"
					},
					"Translation":
					{
						"Text": "Y"
					},
					"Key": "ArrowLabel_Y"
				},
				{
					"Source":
					{
						"Text": "You are about to generate {0} holograms.\\n\\nThis may cause a temporary freeze.\\n\\nContinue?"
					},
					"Translation":
					{
						"Text": "您即将生成 {0} 个全息图。\\n\\n这可能会导致临时卡顿。\\n\\n继续吗？"
					},
					"Key": "Panel_Confirm_LargeMsg"
				},
				{
					"Source":
					{
						"Text": "You are about to generate {0} holograms.\\n\\nThis will likely cause a significant freeze and may crash the game.\\n\\nAre you sure you want to continue?"
					},
					"Translation":
					{
						"Text": "您即将生成 {0} 个全息图。\\n\\n这可能会导致严重卡顿并可能崩溃游戏。\\n\\n确定要继续吗？"
					},
					"Key": "Panel_Confirm_ExtremeMsg"
				},
				{
					"Source":
					{
						"Text": "Z"
					},
					"Translation":
					{
						"Text": "Z"
					},
					"Key": "ArrowLabel_Z"
				},
				{
					"Source":
					{
						"Text": "[INVALID]"
					},
					"Translation":
					{
						"Text": "[无效]"
					},
					"Key": "HUD_Invalid"
				},
				{
					"Source":
					{
						"Text": "m"
					},
					"Translation":
					{
						"Text": "米"
					},
					"Key": "Panel_Unit_Meters"
				},
				{
					"Source":
					{
						"Text": "{0} Mk.{1}: No valid upgrade target selected"
					},
					"Translation":
					{
						"Text": "{0} Mk.{1}: 未选择有效的升级目标"
					},
					"Key": "Upgrade_NoValidTarget"
				},
				{
					"Source":
					{
						"Text": "{0} [LIMIT HIT]"
					},
					"Translation":
					{
						"Text": "{0} [已达上限]"
					},
					"Key": "Upgrade_FoundItemsLimit"
				},
				{
					"Source":
					{
						"Text": "{0} items → Mk.{1}\n"
					},
					"Translation":
					{
						"Text": "{0} 项 → Mk.{1}\\n"
					},
					"Key": "Upgrade_CostItems"
				},
				{
					"Source":
					{
						"Text": "{0} × {1} Mk.{2} → Mk.{3}\n"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Upgrade_CostHeader"
				},
				{
					"Source":
					{
						"Text": "{0} × {1} Mk.{2} → Mk.{3}\n(Cost unavailable)"
					},
					"Translation":
					{
						"Text": "{0} × {1} Mk.{2} → Mk.{3}\\n(成本不可用)"
					},
					"Key": "Upgrade_CostUnavailable"
				},
				{
					"Source":
					{
						"Text": "°"
					},
					"Translation":
					{
						"Text": "°"
					},
					"Key": "Panel_Unit_Degrees"
				},
				{
					"Source":
					{
						"Text": "← Input: {0} x{1} ({2}/min) (Grid Total: {3}/min)"
					},
					"Translation":
					{
						"Text": "← 输入: {0} x{1} ({2}/分) (网格总计: {3}/分)"
					},
					"Key": "Panel_Recipe_Input"
				},
				{
					"Source":
					{
						"Text": "← Input: {0} x{1} m³ ({2}/min) (Grid Total: {3}/min)"
					},
					"Translation":
					{
						"Text": "← 输入: {0} x{1} m³ ({2}/分) (网格总计: {3}/分)"
					},
					"Key": "Panel_Recipe_InputLiquid"
				},
				{
					"Source":
					{
						"Text": "→ Output: {0} x{1} ({2}/min) (Grid Total: {3}/min)"
					},
					"Translation":
					{
						"Text": "→ 输出: {0} x{1} ({2}/分) (网格总计: {3}/分)"
					},
					"Key": "Panel_Recipe_Output"
				},
				{
					"Source":
					{
						"Text": "→ Output: {0} x{1} m³ ({2}/min) (Grid Total: {3}/min)"
					},
					"Translation":
					{
						"Text": "→ 输出: {0} x{1} m³ ({2}/分) (网格总计: {3}/分)"
					},
					"Key": "Panel_Recipe_OutputLiquid"
				}
			]
		}
	]
}